todos-backend/app/controllers/todos_controller.rb

INSERT INTO "todos" ("description", "completed", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Buy Space Outfit"], ["completed", 0], ["created_at", "2023-01-14 15:52:12.211997"], ["updated_at", "2023-01-14 15:52:12.211997"]]
---
  def create
    @todo = Todo.new(todo_params)

    if @todo.save